student1 = ['Денис - 46', 'Дима - 28', 'Ваня - 34', 'Дима - 27', 'Дима - 33', 'Лёха - 43', 'Вова - 25', 'Вадим - 36', 'Богдан - 19', 'Юра - 39', 'Антон - 43', 'Артем - 37', 'Костя - 49']



student2 = ['Денис - 38', 'Дима - 44', 'Ваня - 27', 'Дима - 33', 'Дима - 47', 'Лёха - 49', 'Вова - 42', 'Вадим - 39', 'Богдан - 47', 'Юра - 45', 'Антон - 31', 'Артем - 34', 'Костя - 49']



student3 = ['28', '28', 'Ваня - 35', 'Дима - 42', 'Дима - 27', 'Лёха - 41', 'Вова - 43', 'Вадим - 39', 'Богдан - 46', 'Юра - 37', 'Антон - 49', 'Артем - 34', 'Костя - 29']

from random import randint
lst = [randint(0, 100) for _ in range(100)]
lst.sort()
if lst/5 in 


Денис - 1
Дима - 2
Ваня - 3
Дима - 4
Дима - 5
Лёха  - 6
Вова - 7
Вадим - 8
Богдан  - 9
Юра - 10
Антон - 11
Артем - 12
Костя - 13